Revit 2026 API

# FabricationServiceButtonGetConditionUpperValue Method

---

Gets the condition upper value (valid if less) for a given condition index.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetConditionUpperValue(
	int condition
)
```
```vb
Public Function GetConditionUpperValue (
	condition As Integer
) As Double
```
```cpp
public:
double GetConditionUpperValue(
	int condition
)
```
```fsharp
member GetConditionUpperValue :
        condition : int -> float
```

#### Parameters

condition Int32
     The condition index.

#### Return Value

Double The condition upper value.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The index condition is not larger or equal to 0 and less than ConditionCount. |

A value of -1 indicates an unrestricted value.

#### Reference

FabricationServiceButton Class

Autodesk.Revit.DB Namespace